biceps_exercises_text = (
    "Двуглавая мышца плеча (бицепс) — большая мышца плеча, хорошо заметна под кожей. Проксимальная "
    "часть состоит из двух головок — длинной и короткой.\n\n"
    "Функция мышцы: сгибает плечо в плечевом суставе, сгибает предплечье в локтевом суставе, "
    "супинирует предплечье, участвует в отведении плеча при внешней ротации руки.")

curls_with_a_barbell_or_EZ_bar_execution = (
    "Возьмите штангу или EZ-штангу прямым или обратным хватом. Стоя или сидя, медленно сгибайте руки, удерживая локти "
    "в неподвижном положении. Опустите штангу в исходное положение."
)

bend_the_arms_on_the_lower_block_execution = (
    "Встаньте лицом к блочному тренажёру, возьмитесь за рукоять нижнего блока. Сгибайте руки, сохраняя напряжение в "
    "бицепсах, затем медленно возвращайтесь в исходное положение."
)

dumbbell_curl_execution = (
    "Возьмите гантели в обе руки, удерживая ладони вверх. Поочерёдно или одновременно сгибайте руки, сохраняя локти "
    "ближе к туловищу, затем возвращайтесь в исходное положение."
)

reverse_grip_pull_ups_execution = (
    "Повисните на перекладине, используя обратный хват (ладони направлены к вам). Подтягивайтесь, пока подбородок не "
    "окажется выше перекладины, затем медленно опускайтесь вниз."
)

bent_over_barbell_row_with_reverse_grip_execution = (
    "Возьмите штангу обратным хватом, наклоните корпус вперёд, удерживая спину прямой. Подтягивайте штангу к животу, "
    "сохраняя локти ближе к телу, затем опустите штангу вниз."
)

hammer_grip_curl_execution = (
    "Возьмите гантели нейтральным хватом (ладони смотрят друг на друга). Сгибайте руки, удерживая локти неподвижными, "
    "затем медленно опустите гантели обратно."
)

incline_dumbbell_curl_execution = (
    "Сядьте на наклонную скамью, держа гантели ладонями вверх. Сгибайте руки, сохраняя локти неподвижными, затем "
    "медленно опустите гантели в исходное положение."
)

concentrated_arm_curls_execution = (
    "Сядьте на скамью, уперев локоть одной руки в бедро. Поднимайте гантель вверх, максимально напрягая бицепс, "
    "затем медленно опустите её вниз."
)

scott_bench_curl_execution = (
    "Сядьте за скамью Скотта, разместив локти на наклонной платформе. Возьмите штангу и медленно сгибайте руки, "
    "затем возвращайтесь в исходное положение."
)

arm_bending_with_elbow_abduction_execution = (
    "Возьмите гантели, начните сгибать руки, одновременно отводя локти в стороны. Вернитесь в исходное положение, "
    "контролируя движение."
)
