triceps_exercises_text = (
    "Трёхглавая мышца плеча (трицепс) — это мышца-разгибатель задней группы плеча, занимающая всю заднюю сторону плеча.\n\n"
    "Она состоит из трёх головок:\n\n"
    "Длинная головка. Начинается сильным сухожилием от подсуставного бугорка лопатки.\n"
    "Латеральная головка. Начинается сухожильными и мышечными пучками на наружной поверхности плечевой кости.\n"
    "Медиальная головка. Имеет мясистое начало на задней поверхности средней трети плеча.\n"
    "Функция трицепса: разгибание предплечья в локтевом суставе, а также разгибание и приведение плеча.\n\n"
    "Антагонист трицепса — двуглавая мышца плеча (бицепс).\n"
)

diamond_push_ups_text = (
    "Алмазные отжимания — это вариация классических отжиманий, при которой руки ставятся близко "
    "друг к другу, образуя форму «алмаза» (большие и указательные пальцы соединяются). Это "
    "упражнение направлено на развитие трицепсов, а также грудных мышц и передних дельт.\n\n"

    "Техника выполнения:\n"
    "1. Примите упор лежа, соединив ладони так, чтобы пальцы образовали треугольник.\n"
    "2. Опускайтесь вниз, держа локти ближе к телу.\n"
    "3. Поднимайтесь вверх, выпрямляя руки.\n\n"

    "Преимущества: укрепляют трицепсы, улучшают стабильность плечевых суставов и развивают общую силу верхней "
    "части тела."
)

reverse_push_ups_on_a_bench_text = (
    "Обратные отжимания на скамье — упражнение для развития трицепсов, передних дельт и верхней части груди.\n\n"

    "Техника выполнения:\n"
    "Сядьте на край скамьи и поставьте руки на неё, пальцы направлены вперед.\n"
    "Вытяните ноги вперёд, опираясь на пятки.\n"
    "Опустите корпус вниз, сгибая локти до угла 90°.\n"
    "Поднимитесь вверх, выпрямляя руки.\n\n"

    "Преимущества: укрепляют трицепсы, развивают силу плеч и стабилизируют локтевые суставы."
)

dips_text = (
    "Отжимания на брусьях — эффективное упражнение для развития грудных мышц, трицепсов и передних дельт.\n\n"

    "Техника выполнения:\n"
    "Возьмитесь за брусья и поднимитесь на прямые руки.\n"
    "Медленно опускайтесь, сгибая локти, до тех пор, пока плечи не окажутся параллельны полу.\n"
    "Поднимайтесь вверх, выпрямляя руки в исходное положение.\n"
    "Преимущества: развивают силу верхней части тела, улучшают выносливость и укрепляют суставы."
)

french_bench_press_with_barbell_text = (
    "Французский жим лёжа со штангой — изолированное упражнение для развития трицепсов.\n\n"

    "Техника выполнения:\n"
    "Лягте на скамью, держите штангу прямым хватом на вытянутых руках над грудью.\n"
    "Медленно опускайте штангу к лбу, сгибая руки в локтях.\n"
    "Вернитесь в исходное положение, разгибая локти.\n"
    "Преимущества: эффективно прорабатывает трицепсы, увеличивает их силу и объём, улучшает стабильность локтевых суставов."
)

dumbbell_overhead_press_text = (
    "Жим гантели из-за головы — изолированное упражнение для проработки трицепсов.\n\n"

    "Техника выполнения:\n"
    "Возьмите гантель обеими руками и поднимите её над головой.\n"
    "Опускайте гантель за голову, сгибая руки в локтях.\n"
    "Поднимите гантель обратно, полностью выпрямляя руки.\n"
    "Преимущества: развивает силу и массу трицепсов, улучшает подвижность плечевых суставов и стабилизирует руки."
)

bent_over_arm_extension_with_dumbbells_text = (
    "Разгибание рук с гантелями в наклоне — изолированное упражнение для проработки трицепсов.\n\n"

    "Техника выполнения:\n"
    "Наклонитесь вперёд, держа гантели в руках, спина прямая.\n"
    "Прижмите локти к корпусу и согните руки под углом 90°.\n"
    "Разгибайте руки назад до полного выпрямления, затем вернитесь в исходное положение.\n"
    "Преимущества: эффективно укрепляет трицепсы, улучшает их рельеф и развивает силу рук."
)

extension_of_one_arm_with_support_on_the_bench_text = (
    "Разгибание одной руки с опорой на лавку — изолированное упражнение для трицепсов, выполняемое с гантелью.\n\n"

    "Техника выполнения:\n"
    "Упритесь одной рукой и коленом в лавку, спина прямая, корпус параллелен полу.\n"
    "Другой рукой держите гантель, локоть прижат к корпусу и согнут под углом 90°.\n"
    "Разгибайте руку назад до полного выпрямления, затем медленно вернитесь в исходное положение.\n"
    "Преимущества: развивает силу и рельеф трицепсов, улучшает контроль движений и стабилизирует плечевой сустав."
)

extension_of_arms_on_a_block_with_a_rope_handle_text = (
    "Разгибание рук на блоке с канатной рукоятью — изолированное упражнение для проработки трицепсов.\n\n"

    "Техника выполнения:\n"
    "Встаньте лицом к блочному тренажёру, возьмитесь за канатную рукоять обеими руками.\n"
    "Прижмите локти к корпусу и держите их неподвижно.\n"
    "Разгибайте руки вниз, разводя канаты в стороны в нижней точке.\n"
    "Медленно вернитесь в исходное положение.\n"
    "Преимущества: эффективно изолирует и прорабатывает трицепсы, улучшает их рельеф и силу, снижает нагрузку на суставы.\n"
)

extension_of_arms_on_a_block_with_a_reverse_grip_text = (
    "Разгибание рук на блоке обратным хватом — упражнение для тренировки трицепсов с акцентом на внутреннюю часть.\n\n"

    "Техника выполнения:\n"
    "Встаньте лицом к блочному тренажёру, возьмитесь за рукоять с обратным хватом (ладони вверх).\n"
    "Прижмите локти к телу и удерживайте их неподвижно.\n"
    "Разгибайте руки вниз, полностью выпрямляя их в нижней точке.\n"
    "Медленно вернитесь в исходное положение.\n"
    "Преимущества: развивает силу и рельеф трицепсов, акцентирует работу на внутренней части мышц, улучшает стабильность локтевых суставов."
)

extension_on_the_block_from_behind_the_head_text = (
    "Разгибания на блоке из-за головы — упражнение для изоляции трицепсов с акцентом на длинную головку мышцы.\n\n"

    "Техника выполнения:\n"
    "Встаньте спиной к блочному тренажёру, возьмитесь за канатную рукоять и поднимите её за голову.\n"
    "Прижмите локти к голове, держите их неподвижно.\n"
    "Разгибайте руки, выпрямляя локти и возвращая канат перед собой.\n"
    "Медленно вернитесь в исходное положение.\n"
    "Преимущества: эффективно тренирует трицепсы, улучшает их рельеф и силу, а также способствует развитию длинной головки трицепса."
)
