def text_hello_welcome():
    text = (
        "\n\nХочу познакомить тебя с нашим проектом\n\n"
        "'Workout Tracker' — это веб-приложение для учета тренировок. Пользователь может выбрать день недели, указать количество подходов, вес и количество повторений, после чего приложение рассчитает общий поднятый вес за тренировку."
    )
    return text


def text_description():
    text = (
        "<b>Функционал проекта:</b>\n\n"
        "    • <b>Выбор дня недели:</b> Пользователь выбирает день, для которого будет добавлена тренировка.\n"
        "    • <b>Ввод данных о тренировке:</b> Пользователь вводит количество подходов, вес и количество повторений для каждого подхода.\n"
        "    • <b>Расчет общего веса:</b> Приложение рассчитывает суммарный поднятый вес за тренировку.\n"
        "    • <b>Отображение результата:</b> Итоговый результат отображается в удобном формате."
    )
    return text
